# ServiceId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalService..::..ServiceId Property
ExternalService Class See Also
---
The Id of the service
**Namespace:** Autodesk.Revit.DB.ExternalService**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ExternalServiceId ServiceId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ServiceId As ExternalServiceId
	Get
```

Visual C++
---
```text
public:
property ExternalServiceId^ ServiceId {
	ExternalServiceId^ get ();
}
```

# See Also
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace